{
  "Save": "Save",
  "start": "Start",
  "onPage": "On this page",
  "Community": "Community",
  "Search": "Search",
  "Searching":"Search...",
  "Menu": "Menu",
  "Pager": "Pager",
  "SidebarMenu": "Sidebar menu",
  "NavigationItem": "List of navigation item",
  "EditThisPage": "Edit this page",
  "PreviousPage": "Previous page",
  "NextPage": "Next page",
  "PageNotFound": "Page not found",
  "GoBackHome": "Go back home",
  "SwitchTheme": "Switch theme",
  "SwitchLanguage": "Switch language",
  "CopyCode": "Copy code to clipboard",
  "Component": "Component",
  "Code": "Code",
  "Options":  "Options",
  "nameTable": "Name table",
  "resultsTable": "Table results",
  "button": {
    "yes": "Yes",
    "no": "No",
    "Register": "Register",
    "deactivate": "Deactivate",
    "cancel": "Cancel",
    "clickMe": "Click Me",
    "check": "Check",
    "loading": "Loading"
  },
  "label": {
    "name": "Name",
    "mode": "Mode",
    "open": "Open",
    "label": "Label",
    "labelMode": "Label Mode",
    "isInvalid": "Is Invalid",
    "messageInvalid": "Invalid Message",
    "required": "Required",
    "loading": "Loading",
    "disabled": "Disabled",
    "visible": "Visible",
    "clear": "Clear",
    "help": "Help",
    "width": "Width",
    "height": "Height",
    "animation": "Animation",
    "classBody": "Body Class",
    "class": "Class",
    "Type": "Type",
    "sizePage": "Size Page",
    "sizesSelector": "Page Size Selector",
    "visibleNumberPages": "Visible Number of Pages",
    "total": "Total",
    "isInfoText": "Show Info Text",
    "isPageSizeSelector": "Show Page Size Selector",
    "isHiddenNavigationButtons": "Hide Navigation Buttons",
    "autoFocus": "Auto Focus",
    "placeholder": "Placeholder",
    "autocomplete": "Autocomplete",
    "maskInput": "Mask Input",
    "lengthInteger": "Integer Length",
    "lengthDecimal": "Decimal Length",
    "classInput": "Input Class",
    "DataSelect": "Select Data",
    "keySelect": "Select Key",
    "valueSelect": "Select Value",
    "multiple": "Multiple",
    "maxVisible": "Max Visible",
    "closeButtonBadge": "Close Button Badge",
    "noData": "No Data",
    "noQuery": "No Query",
    "classSelect": "Select Class",
    "classSelectList": "Select List Class",
    "classMaskQuery": "Mask Query Class",
    "isNotCloseOnDateChange": "Not Close on Date Change",
    "classDataPicker": "Date Picker Class",
    "classPicker": "Picker Class",
    "tableZones": "Table zones",
    "tableBorder": "Table border",
    "hoverRows": "Hover selection",
    "isStripedRows": "Alternating lines",
    "horizontalLines": "Horizontal Lines",
    "verticalLines": "Vertical Lines",
    "filterLines": "Filter Lines",
    "wrap": "Wrap",
    "rows": "Rows",
    "maxLength": "Max Length",
    "orientation": "Orientation",
    "direction": "Direction",
    "vertical": "Vertical",
    "contentPosition": "Content Position",
    "gradient": "Gradient",
    "depth": "Depth",
    "classBodyLine": "Body Line Class",
    "classLine": "Line Class",
    "classContent": "Content Class",
    "classBodyLineLeft": "Left Body Line Class",
    "classLineLeft": "Left Line Class",
    "classBodyLineRight": "Right Body Line Class",
    "classLineRight": "Right Line Class",
    "borderRadiusPx": "Border Radius (px)",
    "heightCell": "Cell Height",
    "classDateText": "Date Text Class",
    "switchingType": "Switching Type",
    "modeSwitch": "Switch Mode",
    "size": "Size",
    "rounded": "Rounded",
    "color": "Color",
    "classIcon": "Class Icon",
    "icon": "Icon",
    "iconPosition": "Icon position",
    "type": "Type",
    "iconActive": "Active Icon",
    "iconInactive": "Inactive Icon",
    "Username": "Username",
    "Email": "Email",
    "Password": "Password",
    "createdAt": "Created At",
    "updatedAt": "Updated At",
    "isActive": "Is Active",
    "role": "Role",
    "age": "Age",
    "position": "Position",
    "typePosition": "Type Position",
    "eventOpen": "Event Open",
    "eventClose": "Event Close",
    "delay": "Delay",
    "marginPx": "Margin (px)",
    "translatePx": "Translate (px)",
    "paddingWindow": "Padding Window (px)",
    "notAnimate": "Disable Animation",
    "closeButton": "Close Button",
    "withoutMargin": "Without Margin",
    "notCloseBackground": "Disable Background Close",
    "additionalInformation": "Specify personal information",
    "countVisibleRows": "Visible rows",
    "nameButton": "Name button",
    "animationDuration": "Animation Duration",
    "classItem": "Item Class",
    "classTitle": "Title Class",
    "classSubtitle": "Subtitle Class",
    "Input": "Input",
    "Select": "Select",
    "Calendar": "Calendar",
    "Aria": "Aria",
    "TextEditor": "TextEditor",
    "Switch": "Switch",
    "Custom": "Custom",
    "isViewUsername": "View Username",
    "isViewEmail": "View Email",
    "isViewPassword": "View Password",
    "requiredRule": "Required rule",
    "requiredRuleBase": "Required role with a basic message",
    "requiredRuleCustom": "Required role with a custom message",
    "emailRule": "Email rule",
    "emailRuleBase": "Email rule with a basic message",
    "emailRuleCustom": "Email rule with a custom message",
    "phoneRule": "Phone rule",
    "phoneRuleBase": "Phone rule with a basic message",
    "phoneRuleCustom": "Phone rule with a custom message",
    "numericRule": "Numeric rule",
    "numericRuleBase": "Numeric rule with a basic message",
    "numericRuleCustom": "Numeric rule with a custom message",
    "regularRule": "Regular rule",
    "regularRuleBase": "Regular rule with a basic message",
    "regularRuleCustom": "Regular rule with a custom message",
    "rangeRule": "Range rule",
    "rangeRuleBase": "Range rule with a basic message",
    "rangeRuleCustom": "Range rule with a custom message",
    "lengthRule": "Length rule",
    "lengthRuleBase": "Length rule with a basic message",
    "lengthRuleCustom": "Length rule with a custom message",
    "asyncRule": "Async rule",
    "asyncRuleBase": "Async rule with a basic message",
    "asyncRuleCustom": "Async rule with a custom message",
    "customRule": "Custom rule",
    "customRuleBase": "Custom rule with a basic message",
    "customRuleCustom": "Custom rule with a custom message",
    "compareRule": "Compare rule",
    "compareRuleBase": "Compare rule with a basic message",
    "compareRuleCustom": "Compare rule with a custom message"
  },
  "help": {
    "mode": "Defines the styling mode for the component. Possible values: 'default', 'inline', 'block'.",
    "label": "The text label associated with the input field. This label is displayed above or beside the input element.",
    "labelMode": "Defines how the label is displayed. Possible values: 'floating', 'inline', 'hidden'.",
    "isInvalid": "Indicates whether the input is in an invalid state. Set to true if the input has validation errors.",
    "messageInvalid": "The validation error message to display when the input is invalid.",
    "required": "Specifies whether the input field is required. Set to true if the input must be filled out before submitting the form.",
    "loading": "Indicates whether the input field is in a loading state. Set to true to show a loading spinner.",
    "disabled": "Disables the input field, making it uneditable. Set to true to disable the input.",
    "clear": "Enables a clear button to reset the input field. Set to true to show a clear button.",
    "help": "Additional help text displayed below the input field. Use this to provide extra information to the user.",
    "width": "Specifies the width of the input field. Can be set to any valid CSS width value (e.g., '100px', '50%').",
    "height": "Specifies the height of the input field. Can be set to any valid CSS height value (e.g., '50px', 'auto').",
    "animation": "Defines the animation for transitions within the layout. Possible values: 'transition-all duration-500', 'transition-none'.",
    "classBody": "Custom CSS class for the body of the layout. Use this to apply additional styles to the input body.",
    "class": "Custom CSS class for the layout container. Use this to apply additional styles to the input layout.",
    "Type": "The type of input field. Possible values: 'text', 'number', 'email', 'password'.",
    "autoFocus": "Automatically focuses the input field on mount. Set to true to enable auto-focus.",
    "placeholder": "Placeholder text for the input field. Displayed when the input is empty.",
    "autocomplete": "Autocomplete behavior for the input field. Possible values: 'on', 'off'.",
    "maskInput": "Mask type for the input value. Possible values: 'phone', 'number', 'price', or a custom mask string.",
    "lengthInteger": "Maximum length for the integer part of the input value. Set to a number to limit the integer part.",
    "lengthDecimal": "Maximum length for the decimal part of the input value. Set to a number to limit the decimal part.",
    "classInput": "Custom CSS class for the input element. Use this to apply additional styles to the input.",
    "DataSelect": "The data items available for selection in a dropdown list. Should be an array of items.",
    "keySelect": "The key used to uniquely identify each item in the data set. Set to the property name used as the key.",
    "valueSelect": "The key used to retrieve the display value of each item. Set to the property name used as the display value.",
    "multiple": "Enables multiple item selection. Set to true to allow selecting multiple items.",
    "maxVisible": "Maximum visible number of selected items. Set to a number to limit the number of visible items.",
    "closeButtonBadge": "Enables a close button for badges in multiple selection mode. Set to true to show a close button on badges.",
    "noData": "Text displayed when there are no items in the list. Use this to provide a message when the list is empty.",
    "noQuery": "Disables the query-based filtering of items. Set to true to disable filtering.",
    "classSelect": "Custom CSS class for the select container. Use this to apply additional styles to the select container.",
    "classSelectList": "Custom CSS class for the dropdown list container. Use this to apply additional styles to the dropdown list.",
    "classMaskQuery": "Custom CSS class for the query text mask. Use this to apply additional styles to the query text.",
    "isNotCloseOnDateChange": "Prevents the calendar from closing when a date is selected. Set to true to keep the calendar open after selecting a date.",
    "classDataPicker": "Custom CSS class for the data picker. Use this to apply additional styles to the data picker.",
    "classPicker": "Custom CSS class for the calendar picker. Use this to apply additional styles to the calendar picker.",
    "classDateText": "Custom CSS class for the displayed date text. Use this to apply additional styles to the date text.",
    "switchingType": "The type of switching mechanism for a switch component. Possible values: 'checkbox', 'switch'.",
    "modeSwitch": "The styling mode for the switch component. Possible values: 'default', 'compact'.",
    "size": "Controls the overall dimensions of the component. Accepts predefined size categories or numeric values for precise scaling.",
    "rounded": "Defines the degree of corner rounding. Accepts a range of numeric values or a keyword for maximum rounding.",
    "color": "Determines the component's color scheme. Supports standard color definitions or thematic identifiers.",
    "classIcon": "Applies a custom styling class to the icon for tailored visual adjustments.",
    "icon": "Sets an icon to be displayed within the component. Refers to an identifier from an icon set.",
    "iconPosition": "Specifies the placement of the icon relative to the component's content. Accepts positional keywords.",
    "type": "Indicates the functional or visual category of the component. Defines its core behavior or structure.",
    "iconActive": "Icon displayed when the switch is active. Set to the icon type for the active state.",
    "iconInactive": "Icon displayed when the switch is inactive. Set to the icon type for the inactive state.",
    "additionalInformation": "Additional information",
    "customForm": "This place can be occupied by your HTML code or your components.",
    "sizePage": "Defines the number of items to display per page in pagination.",
    "sizesSelector": "Select the number of items to display per page. This allows users to customize the pagination according to their preferences.",
    "visibleNumberPages": "Set the number of page links visible in the pagination control. This helps users navigate through the pages more efficiently.",
    "total": "Displays the total number of items or records. This provides an overview of the entire dataset.",
    "isInfoText": "Toggle the visibility of informational text that provides context about the current page and total items. This helps users understand their position within the dataset.",
    "isPageSizeSelector": "Toggle the visibility of the page size selector. This allows users to choose how many items they want to see per page.",
    "isHiddenNavigationButtons": "Toggle the visibility of navigation buttons (e.g., Next, Previous). This can be used to simplify the interface or to control user navigation.",
    "countVisibleRows": "Defines the number of rows to display in the table.",
    "tableZones": "Select specific zones within the table to highlight and focus on. This feature allows you to visually distinguish and analyze different sections of your data more effectively.",
    "tableBorder": "Select different borders of the table to customize and highlight. This feature allows you to visually define and emphasize the boundaries of your data sections for better clarity and presentation.",
    "horizontalLines": "Toggle the visibility of horizontal lines within the table to enhance readability and structure. This helps in distinguishing rows more clearly.",
    "verticalLines": "Toggle the visibility of vertical lines within the table to enhance readability and structure. This helps in distinguishing columns more clearly.",
    "filterLines": "Apply filters to specific lines within the table to highlight or hide data based on your criteria. This feature allows for more focused data analysis.",
    "borderRadiusPx": "Adjust the border radius of the table cells in pixels to create rounded corners. This setting enhances the visual appearance and can make the table look more modern and polished.",
    "heightCell": "Set the height of the table cells to customize the vertical spacing within the table. Adjusting the cell height can improve readability and overall layout.",
    "createdAt": "Indicates the date and time when the record was created. This helps track the origin of the data.",
    "updatedAt": "Indicates the date and time when the record was last updated. This helps track changes and modifications to the data.",
    "isActive": "Shows whether the record is currently active or inactive. This can be used to filter out inactive records.",
    "role": "Specifies the role or permission level associated with the record. This helps in managing access and responsibilities.",
    "age": "Displays the age of the record or entity. This can be used for demographic analysis or to track the lifecycle of the data.",
    "animationDuration": "Set the duration of the animation in milliseconds. This controls how long the animation effects will last, enhancing the visual experience.",
    "classItem": "Specify the CSS class for individual items. This allows you to apply custom styles to items within the component.",
    "classTitle": "Specify the CSS class for the title. This allows you to apply custom styles to the title element within the component.",
    "classSubtitle": "Specify the CSS class for the subtitle. This allows you to apply custom styles to the subtitle element within the component.",
    "vertical": "Toggle the vertical orientation of the component. This changes the layout from horizontal to vertical.",
    "contentPosition": "Set the position of the content within the component. Options may include top, center, bottom, left, or right.",
    "gradient": "Apply a gradient effect to the component. This can enhance the visual appeal by adding color transitions.",
    "depth": "Adjust the depth or z-index of the component. This controls the stacking order of elements, affecting which elements appear in front of others.",
    "classBodyLine": "Specify the CSS class for the body line of the component. This allows you to apply custom styles to the body line.",
    "classLine": "Specify the CSS class for the line elements within the component. This allows you to apply custom styles to lines.",
    "classContent": "Specify the CSS class for the content area of the component. This allows you to apply custom styles to the content.",
    "classBodyLineLeft": "Specify the CSS class for the left body line of the component. This allows you to apply custom styles to the left body line.",
    "classLineLeft": "Specify the CSS class for the left line elements within the component. This allows you to apply custom styles to left lines.",
    "classBodyLineRight": "Specify the CSS class for the right body line of the component. This allows you to apply custom styles to the right body line.",
    "classLineRight": "Specify the CSS class for the right line elements within the component. This allows you to apply custom styles to right lines.",
    "wrap": "Enable or disable text wrapping within the component. Wrapping text can improve readability by preventing overflow.",
    "rows": "Specify the number of rows to display. This setting controls the vertical size of the component.",
    "maxLength": "Set the maximum length of the text or content. This limits the number of characters that can be entered or displayed.",
    "direction": "Set the direction of the content flow. Options typically include 'ltr' (left-to-right) and 'rtl' (right-to-left). This setting is useful for supporting different languages and reading directions.",
    "closeButton": "Toggle the visibility of the close button. This button allows users to close the component or dialog.",
    "withoutMargin": "Remove margins around the component. This setting can be used to eliminate extra spacing and make the component fit more tightly within its container.",
    "notAnimate": "Disable animations for the component. This can improve performance and reduce visual distractions.",
    "position": "Set the position of the component on the screen. Options may include top, bottom, left, right, center, etc.",
    "notCloseBackground": "Prevent the component from closing when clicking outside of it. This ensures the component remains open until explicitly closed by the user.",
    "typePosition": "Specify the type of positioning for the element.",
    "eventOpen": "Specify the event that triggers the opening of the fixed window.",
    "eventClose": "Specify the event that triggers the closing of the fixed window.",
    "delay": "Set the delay time in milliseconds.",
    "marginPx": "Set the margin in pixels.",
    "translatePx": "Set the translation in pixels.",
    "paddingWindow": "Set the padding for the window in pixels."
  },
  "placeholder": {
    "Username": "Enter your username",
    "Email": "Enter your email",
    "Password": "Enter your password"
  },
  "content": {
    "user": {
      "title": "User Information",
      "description": "Please provide your user information"
    },
    "additionalInformation": {
      "title": "Personal information",
      "description": "Use a permanent address to which you can receive mail."
    },
    "rules": {
      "requiredRule": {
        "title": "Required rule",
        "description": "Ensures the field is not empty."
      },
      "emailRule": {
        "title": "Email rule",
        "description": "Validates that the input is a properly formatted email address."
      },
      "phoneRule": {
        "title": "Phone rule",
        "description": "Checks if the input matches a valid phone number format."
      },
      "numericRule": {
        "title": "Numeric rule",
        "description": "Confirms the input contains only numbers."
      },
      "regularRule": {
        "title": "Regular rule",
        "description": "Tests the input against a regular expression or string pattern."
      },
      "rangeRule": {
        "title": "Range rule",
        "description": "Ensures the numeric input falls within a specified min/max range."
      },
      "lengthRule": {
        "title": "Length rule",
        "description": "Validates the input length against min/max constraints."
      },
      "asyncRule": {
        "title": "Async rule",
        "description": "Runs an asynchronous validation function, useful for server-side checks."
      },
      "customRule": {
        "title": "Custom rule",
        "description": "Applies a custom synchronous validation function."
      },
      "compareRule": {
        "title": "Compare rule",
        "description": "Compares the field’s value with other form fields."
      }
    },
    "dialog": {
      "index": "Dialog",
      "base": {
        "button": "Base Dialog"
      },
      "size": {
        "title": "Dialog Title",
        "size": "Size",
        "text": "Welcome to our project! This platform is designed to streamline collaboration, enhance productivity,\nand provide a seamless experience for managing tasks. Whether you are working individually or with a team,\nour tools and features are tailored to ensure efficiency and success in achieving your goals. Join us as we redefine\nhow modern projects are executed."
      },
      "position": {
        "title": "The headline",
        "text": "There can be any text, images, instructions, forms, and any interface at all."
      },
      "notCloseBackground": {
        "title": "Deactivate your account",
        "message": "Are you sure you want to deactivate your account? All your data will be permanently deleted. This action cannot be undone."
      },
      "background": {
        "text": "This dialog has a custom background."
      }
    }
  },
  "message": {
    "requiredRule": "This custom field is required",
    "emailRule": "Please enter a valid email address",
    "phoneRule": "Please enter a valid phone number",
    "numericRule": "Value must be numeric",
    "regularRule": "Input does not match required pattern",
    "rangeRule": "Value must be between {min} and {max}",
    "lengthRule": "Length must be between {min} and {max} characters",
    "asyncRule": "the entered {mail} mail already exists",
    "customRule": "Not included in the available list of fruits",
    "compareRule": "Does not match the password",
    "noData": "No data available at the moment.",
    "noColumn": "No columns defined for the table.",
    "noFilter": "There are no satisfying filters"
  },
  "caption": {
    "id": "ID",
    "name": "Name",
    "description": "Description",
    "startDate": "Start Date",
    "endDate": "End Date",
    "createdAt": "Created At",
    "updatedAt": "Updated At",
    "isActive": "Is Active",
    "role": "Role",
    "age": "Age",
    "color": "Color",
    "weightGrams": "Weight (grams)",
    "isTropical": "Is Tropical",
    "originCountry": "Country of Origin",
    "pricePerKg": "Price per Kg",
    "brand": "Brand",
    "model": "Model",
    "year": "Year",
    "fuel": "Fuel",
    "mileageKm": "Mileage (km)",
    "priceUSD": "Price (USD)",
    "isUsed": "Is Used",
    "country": "Country",
    "population": "Population",
    "areaKm2": "Area (km²)",
    "climate": "Climate",
    "isCapital": "Is Capital",
    "region": "Region",
    "stars": "Star rating",
    "isRecommended": "Recommended",
    "roomsAvailable": "Rooms available",
    "pricePerNightUSD": "Price per night (USD)",
    "totalUsers": "Total Users",
    "activeUsers": "Active Users",
    "newUsersToday": "New Users Today",
    "totalRevenue": "Total Revenue",
    "averageRevenuePerUser": "Average Revenue Per User",
    "totalOrders": "Total Orders",
    "completedOrders": "Completed Orders",
    "pendingOrders": "Pending Orders",
    "averageOrderValue": "Average Order Value",
    "customerSatisfaction": "Customer Satisfaction"
  },
  "displayFormat": {
    "id": "ID:",
    "name": "Name:",
    "description": "Description:",
    "startDate": "Start Date:",
    "endDate": "End Date:",
    "createdAt": "Created At:",
    "updatedAt": "Updated At:",
    "color": "Color:",
    "weightGrams": "Weight (grams):",
    "isTropical": "Is Tropical:",
    "originCountry": "Country of Origin:",
    "pricePerKg": "Price per Kg:",
    "brand": "Brand:",
    "model": "Model:",
    "year": "Year:",
    "fuel": "Fuel:",
    "mileageKm": "Mileage (km):",
    "priceUSD": "Price (USD):",
    "isUsed": "Is Used:",
    "country": "Country:",
    "population": "Population:",
    "areaKm2": "Area (km²):",
    "climate": "Climate:",
    "isCapital": "Is Capital:",
    "region": "Region:",
    "stars": "Star rating:",
    "isRecommended": "Recommended:",
    "roomsAvailable": "Rooms available:",
    "pricePerNightUSD": "Price per night (USD):",
    "totalUsers": "Total Users:",
    "activeUsers": "Active Users:",
    "newUsersToday": "New Users Today:",
    "totalRevenue": "Total Revenue:",
    "averageRevenuePerUser": "Average Revenue Per User:",
    "totalOrders": "Total Orders:",
    "completedOrders": "Completed Orders:",
    "pendingOrders": "Pending Orders:",
    "averageOrderValue": "Average Order Value:",
    "customerSatisfaction": "Customer Satisfaction:"
  },
  "title": {
    "toolbar": "Toolbar",
    "header": "Header",
    "footer": "Footer",
    "openedOnClick": "Opened on click"
  }
}