{
  "Save": "Сохранить",
  "start": "Начало",
  "onPage": "На этой странице",
  "Community": "Сообщество",
  "Search": "Поиск",
  "Searching": "Идет поиск...",
  "Menu": "Меню",
  "Pager": "Пейджер",
  "SidebarMenu": "Боковое меню",
  "NavigationItem": "Список навигационных элементов",
  "EditThisPage": "Редактировать эту страницу",
  "PreviousPage": "Предыдущая страница",
  "NextPage": "Следующая страница",
  "PageNotFound": "Страница не найдена",
  "GoBackHome": "Вернуться на главную",
  "SwitchTheme": "Сменить тему",
  "SwitchLanguage": "Сменить язык",
  "CopyCode": "Скопировать код в буфер обмена",
  "Component": "Компонент",
  "Code": "Код",
  "Options": "Опции",
  "label": {
    "mode": "Режим",
    "label": "Метка",
    "labelMode": "Режим метки",
    "isInvalid": "Недействительно",
    "messageInvalid": "Сообщение об ошибке",
    "required": "Обязательно",
    "loading": "Загрузка",
    "disabled": "Отключено",
    "clear": "Очистить",
    "help": "Помощь",
    "width": "Ширина",
    "height": "Высота",
    "animation": "Анимация",
    "classBody": "Класс тела",
    "class": "Класс",
    "Type": "Тип",
    "autoFocus": "Автофокус",
    "placeholder": "Заполнитель",
    "autocomplete": "Автозаполнение",
    "maskInput": "Маска ввода",
    "lengthInteger": "Длина целой части",
    "lengthDecimal": "Длина десятичной части",
    "classInput": "Класс ввода",
    "DataSelect": "Данные для выбора",
    "keySelect": "Ключ выбора",
    "valueSelect": "Значение выбора",
    "multiple": "Множественный выбор",
    "maxVisible": "Максимальное количество видимых элементов",
    "closeButtonBadge": "Кнопка закрытия значка",
    "noData": "Нет данных",
    "noQuery": "Нет запроса",
    "classSelect": "Класс выбора",
    "classSelectList": "Класс списка выбора",
    "classMaskQuery": "Класс маски запроса",
    "isNotCloseOnDateChange": "Не закрывать при изменении даты",
    "classDataPicker": "Класс выбора даты",
    "classPicker": "Класс выбора",
    "classDateText": "Класс текста даты",
    "switchingType": "Тип переключения",
    "modeSwitch": "Режим переключения",
    "rounded": "Закругленный",
    "iconActive": "Иконка активного состояния",
    "iconInactive": "Иконка неактивного состояния"
  },
  "helps": {
    "mode": "Определяет режим стилизации для компонента. Возможные значения: 'default', 'inline', 'block'.",
    "label": "Текстовая метка, связанная с полем ввода. Эта метка отображается над или рядом с элементом ввода.",
    "labelMode": "Определяет, как отображается метка. Возможные значения: 'floating', 'inline', 'hidden'.",
    "isInvalid": "Указывает, находится ли ввод в недопустимом состоянии. Установите значение true, если ввод содержит ошибки валидации.",
    "messageInvalid": "Сообщение об ошибке валидации, отображаемое, когда ввод недействителен.",
    "required": "Указывает, является ли поле ввода обязательным. Установите значение true, если ввод должен быть заполнен перед отправкой формы.",
    "loading": "Указывает, находится ли поле ввода в состоянии загрузки. Установите значение true, чтобы показать индикатор загрузки.",
    "disabled": "Отключает поле ввода, делая его недоступным для редактирования. Установите значение true, чтобы отключить ввод.",
    "clear": "Включает кнопку очистки для сброса поля ввода. Установите значение true, чтобы показать кнопку очистки.",
    "help": "Дополнительный текст помощи, отображаемый под полем ввода. Используйте это, чтобы предоставить дополнительную информацию пользователю.",
    "width": "Указывает ширину поля ввода. Можно установить любое допустимое значение ширины CSS (например, '100px', '50%').",
    "height": "Указывает высоту поля ввода. Можно установить любое допустимое значение высоты CSS (например, '50px', 'auto').",
    "animation": "Определяет анимацию для переходов в макете. Возможные значения: 'transition-all duration-500', 'transition-none'.",
    "classBody": "Пользовательский CSS-класс для тела макета. Используйте это, чтобы применить дополнительные стили к телу ввода.",
    "class": "Пользовательский CSS-класс для контейнера макета. Используйте это, чтобы применить дополнительные стили к макету.",
    "Type": "Тип поля ввода. Возможные значения: 'text', 'number', 'email', 'password'.",
    "autoFocus": "Автоматически фокусирует поле ввода при его монтировании. Установите значение true, чтобы включить автофокус.",
    "placeholder": "Текст подсказки для поля ввода. Отображается, когда ввод пуст.",
    "autocomplete": "Поведение автозаполнения для поля ввода. Возможные значения: 'on', 'off'.",
    "maskInput": "Тип маски для значения ввода. Возможные значения: 'phone', 'number', 'price', или пользовательская строка маски.",
    "lengthInteger": "Максимальная длина для целой части значения ввода. Установите значение number, чтобы ограничить целую часть.",
    "lengthDecimal": "Максимальная длина для десятичной части значения ввода. Установите значение number, чтобы ограничить десятичную часть.",
    "classInput": "Пользовательский CSS-класс для элемента ввода. Используйте это, чтобы применить дополнительные стили к вводу.",
    "DataSelect": "Элементы данных, доступные для выбора в выпадающем списке. Должны быть массивом элементов.",
    "keySelect": "Ключ, используемый для уникальной идентификации каждого элемента в наборе данных. Установите имя свойства, используемого в качестве ключа.",
    "valueSelect": "Ключ, используемый для получения отображаемого значения каждого элемента. Установите имя свойства, используемого в качестве отображаемого значения.",
    "multiple": "Включает множественный выбор элементов. Установите значение true, чтобы разрешить выбор нескольких элементов.",
    "maxVisible": "Максимальное количество видимых выбранных элементов. Установите значение number, чтобы ограничить количество видимых элементов.",
    "closeButtonBadge": "Включает кнопку закрытия для значков в режиме множественного выбора. Установите значение true, чтобы показать кнопку закрытия на значках.",
    "noData": "Текст, отображаемый, когда в списке нет элементов. Используйте это, чтобы предоставить сообщение, когда список пуст.",
    "noQuery": "Отключает фильтрацию элементов на основе запроса. Установите значение true, чтобы отключить фильтрацию.",
    "classSelect": "Пользовательский CSS-класс для контейнера выбора. Используйте это, чтобы применить дополнительные стили к контейнеру выбора.",
    "classSelectList": "Пользовательский CSS-класс для контейнера выпадающего списка. Используйте это, чтобы применить дополнительные стили к выпадающему списку.",
    "classMaskQuery": "Пользовательский CSS-класс для маски текстового запроса. Используйте это, чтобы применить дополнительные стили к тексту запроса.",
    "isNotCloseOnDateChange": "Предотвращает закрытие календаря при выборе даты. Установите значение true, чтобы оставить календарь открытым после выбора даты.",
    "classDataPicker": "Пользовательский CSS-класс для выбора данных. Используйте это, чтобы применить дополнительные стили к выбору данных.",
    "classPicker": "Пользовательский CSS-класс для выбора календаря. Используйте это, чтобы применить дополнительные стили к выбору календаря.",
    "classDateText": "Пользовательский CSS-класс для отображаемого текста даты. Используйте это, чтобы применить дополнительные стили к тексту даты.",
    "switchingType": "Тип механизма переключения для компонента переключателя. Возможные значения: 'checkbox', 'switch'.",
    "modeSwitch": "Режим стилизации для компонента переключателя. Возможные значения: 'default', 'compact'.",
    "rounded": "Закругление углов переключателя. Возможные значения: от 1 до 10 или 'full'.",
    "iconActive": "Иконка, отображаемая, когда переключатель активен. Установите тип иконки для активного состояния.",
    "iconInactive": "Иконка, отображаемая, когда переключатель неактивен. Установите тип иконки для неактивного состояния."
  }
}